<a href="https://colab.research.google.com/github/holdenkim/YG/blob/main/YG_week1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#1주차 실기 유형 1 첫번째

In [124]:
data_url='https://raw.githubusercontent.com/Datamanim/datarepo/main/weather/weather2.csv'

In [125]:
import pandas as pd

In [126]:
data = pd.read_csv(data_url)

여름철(6월,7월,8월) 이화동이 수영동보다 높은 기온을 가진 시간대는 몇개인가?

In [127]:
data.head(2)

                  time  이화동강수  이화동기온  수영동강수  수영동기온
0  2020-01-01 00:00:00    0.1   -3.9       0.0       2.5
1  2020-01-01 01:00:00    0.0   -3.1       0.0       3.4

In [128]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8784 entries, 0 to 8783
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   time      8784 non-null   object
 1   이화동강수     8784 non-null   float64
 2   이화동기온     8784 non-null   float64
 3   수영동강수  8784 non-null   float64
 4   수영동기온  8784 non-null   float64
dtypes: float64(4), object(1)
memory usage: 343.2+ KB

In [129]:
data['newtime'] = pd.to_datetime(data.time)

In [130]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8784 entries, 0 to 8783
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   time      8784 non-null   object
 1   이화동강수     8784 non-null   float64
 2   이화동기온     8784 non-null   float64
 3   수영동강수  8784 non-null   float64
 4   수영동기온  8784 non-null   float64
 5   newtime   8784 non-null   datetime64[ns]
dtypes: datetime64[ns](1), float64(4), object(1)
memory usage: 411.9+ KB

In [131]:
data.newtime.dt.month.isin([6,7,8])

0       False
1       False
2       False
3       False
4       False
        ...
8779    False
8780    False
8781    False
8782    False
8783    False
Name: newtime, Length: 8784, dtype: bool

In [132]:
summer= data[data.newtime.dt.month.isin([6,7,8])].reset_index(drop=True)

In [133]:
summer

                     time  이화동강수  ...   수영동기온             newtime
0     2020-06-01 00:00:00    0.0  ...  24.799999 2020-06-01 00:00:00
1     2020-06-01 01:00:00    0.0  ...  23.500000 2020-06-01 01:00:00
2     2020-06-01 02:00:00    0.0  ...  23.100000 2020-06-01 02:00:00
3     2020-06-01 03:00:00    0.0  ...  25.400000 2020-06-01 03:00:00
4     2020-06-01 04:00:00    0.0  ...  24.500000 2020-06-01 04:00:00
...                   ...    ...  ...        ...                 ...
2203  2020-08-31 19:00:00    0.0  ...  24.100000 2020-08-31 19:00:00
2204  2020-08-31 20:00:00    0.0  ...  24.200001 2020-08-31 20:00:00
2205  2020-08-31 21:00:00    0.0  ...  24.600000 2020-08-31 21:00:00
2206  2020-08-31 22:00:00    0.0  ...  24.900000 2020-08-31 22:00:00
2207  2020-08-31 23:00:00    0.0  ...  26.900000 2020-08-31 23:00:00

[2208 rows x 6 columns]

In [134]:
len(summer[summer['이화동기온'] > summer['수영동기온']])

1415

이화동과 수영동 최대 강수량 시간대 구하기

In [135]:
data[data['이화동강수'] == data['이화동강수'].max()]['time']

6561    2020-09-30 09:00:00
Name: time, dtype: object

In [136]:
data[data ['수영동강수'] == data ['수영동강수'].max()]['time']

4908    2020-07-23 12:00:00
Name: time, dtype: object

#1주차 실기유형 1 두번째

In [137]:
import pandas as pd

In [138]:
data = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/churn/train.csv')

In [139]:
data.head(5)

   RowNumber  CustomerId     Surname  ...  IsActiveMember EstimatedSalary Exited
0       6842    15793491  Cherkasova  ...               0        65482.94      0
1       8963    15607874       Keane  ...               1       137276.83      0
2       7047    15737627      Rivero  ...               0         3529.72      0
3       7503    15697844  Whitehouse  ...               0       136119.96      1
4       3439    15722404   Carpenter  ...               1       127939.19      0

[5 rows x 14 columns]

남성 이탈(Exited)이 가장 많은 국가(Geography)는 어디이고 이탈 인원은 몇명인가?

In [140]:
data[data.Gender == 'Male'].groupby('Geography')['Exited'].sum()

Geography
France     285
Germany    287
Spain      137
Name: Exited, dtype: int64

In [141]:
data[data.Gender == 'Male'].groupby('Geography')['Exited'].sum().sort_values(ascending=False)

Geography
Germany    287
France     285
Spain      137
Name: Exited, dtype: int64

In [142]:
data.loc[data.Gender=='Male'].groupby(['Geography']).sum().Exited.sort_values(ascending=False)

Geography
Germany    287
France     285
Spain      137
Name: Exited, dtype: int64

In [143]:
data.loc[data.Gender=='Male'].groupby(['Geography']).sum().Exited.sort_values(ascending=False).index[0]

'Germany'

In [144]:
data.loc[data.Gender=='Male'].groupby(['Geography']).sum().Exited.sort_values(ascending=False).values[0]

287

카드를 소유(HasCrCard ==1)하고 있으면서 활성멤버(IsActiveMember ==1) 인 고객들의 평균나이는?

In [145]:
data[(data.HasCrCard ==1 ) & (data.IsActiveMember ==1)].Age.mean()

39.61019283746556

Balance 값이 중간값 이상을 가지는 고객들의 CreditScore의 표준편차를 구하여라

In [146]:
data[data.Balance >= data.Balance.median()]['CreditScore'].std()

97.29451567120783

#1주차 실기 유형 2 첫번째

In [147]:
trainData_url = 'https://raw.githubusercontent.com/Datamanim/datarepo/main/churn/train.csv'
testData_url = 'https://raw.githubusercontent.com/Datamanim/datarepo/main/churn/test.csv'
subData_url = 'https://raw.githubusercontent.com/Datamanim/datarepo/main/churn/submission.csv'

In [148]:
trainData = pd.read_csv(trainData_url)
testData = pd.read_csv(testData_url)
subData = pd.read_csv(subData_url)

In [149]:
trainData.head(5)

   RowNumber  CustomerId     Surname  ...  IsActiveMember EstimatedSalary Exited
0       6842    15793491  Cherkasova  ...               0        65482.94      0
1       8963    15607874       Keane  ...               1       137276.83      0
2       7047    15737627      Rivero  ...               0         3529.72      0
3       7503    15697844  Whitehouse  ...               0       136119.96      1
4       3439    15722404   Carpenter  ...               1       127939.19      0

[5 rows x 14 columns]

In [150]:
left = trainData[['CreditScore','Age','Tenure','Balance','NumOfProducts','HasCrCard','IsActiveMember','EstimatedSalary']]

In [151]:
Dummy_raw = trainData[['Geography','Gender']]

In [152]:
Dummies_train = pd.get_dummies(Dummy_raw)

In [153]:
Dummies_train.head(5)

   Geography_France  Geography_Germany  ...  Gender_Female  Gender_Male
0                 0                  1  ...              0            1
1                 1                  0  ...              0            1
2                 0                  1  ...              1            0
3                 0                  0  ...              1            0
4                 1                  0  ...              1            0

[5 rows x 5 columns]

In [154]:
X = pd.concat([left,Dummies_train], axis=1)

In [155]:
X.head(2)

   CreditScore  Age  Tenure  ...  Geography_Spain  Gender_Female  Gender_Male
0          714   26       3  ...                0              0            1
1          687   38       0  ...                0              0            1

[2 rows x 13 columns]

In [156]:
X.describe()

       CreditScore          Age  ...  Gender_Female  Gender_Male
count  7999.000000  7999.000000  ...    7999.000000  7999.000000
mean    650.417302    38.873984  ...       0.450556     0.549444
std      96.720179    10.436156  ...       0.497580     0.497580
min     350.000000    18.000000  ...       0.000000     0.000000
25%     584.000000    32.000000  ...       0.000000     0.000000
50%     652.000000    37.000000  ...       0.000000     1.000000
75%     718.000000    44.000000  ...       1.000000     1.000000
max     850.000000    92.000000  ...       1.000000     1.000000

[8 rows x 13 columns]

In [157]:
y =data[['Exited']]

In [158]:
from sklearn.model_selection import train_test_split

In [159]:
X_train, X_test, y_train, y_test = train_test_split(X, y, stratify=y,test_size=0.33)

In [160]:
from sklearn.preprocessing import MinMaxScaler

In [161]:
mms = MinMaxScaler()

In [162]:
mms.fit(X_train)

MinMaxScaler()

In [163]:
X_train_scaled = mms.transform(X_train)
X_test_scaled = mms.transform(X_test)

In [164]:
from sklearn.ensemble import RandomForestClassifier

In [165]:
model = RandomForestClassifier()

In [166]:
model.fit(X_train_scaled, y_train)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  """Entry point for launching an IPython kernel.

RandomForestClassifier()

In [167]:
pred_train = model.predict(X_train_scaled)
pred_test = model.predict(X_test_scaled)

In [168]:
from sklearn.metrics import f1_score

In [169]:
score_train = f1_score(y_train, pred_train)
score_test = f1_score(y_test, pred_test)

In [170]:
print(score_train)

1.0

In [171]:
print(score_test)

0.5727699530516431

In [172]:
submission = pd.read_csv(subData_url,index_col=0)

In [173]:
submission.shape

(2001, 0)

In [174]:
testData.shape

(2001, 13)

In [175]:
testData.head(2)

   RowNumber  CustomerId Surname  ...  HasCrCard IsActiveMember EstimatedSalary
0       8438    15591428   Myers  ...          0              0        172097.4
1       5282    15620372   Cross  ...          0              0         48228.1

[2 rows x 13 columns]

In [176]:
left_sub = testData[['CreditScore','Age','Tenure','Balance','NumOfProducts','HasCrCard','IsActiveMember','EstimatedSalary']]
Dummy_raw_sub = testData[['Geography','Gender']]
Dummies_train_sub = pd.get_dummies(Dummy_raw_sub)
X_sub = pd.concat([left_sub,Dummies_train_sub], axis=1)

In [177]:
X_sub.head(2)

   CreditScore  Age  Tenure  ...  Geography_Spain  Gender_Female  Gender_Male
0          781   29       9  ...                0              0            1
1          687   31       3  ...                1              0            1

[2 rows x 13 columns]

In [178]:
sub_ready = model.predict(X_sub)

/usr/local/lib/python3.7/dist-packages/sklearn/base.py:439: UserWarning: X has feature names, but RandomForestClassifier was fitted without feature names
  f"X has feature names, but {self.__class__.__name__} was fitted without"

In [179]:
sub_ready.shape

(2001,)

In [180]:
submission[0] = sub_ready
submission.to_csv('submission_model.csv',index=False)

#1주차 실기 유형 2 두번째

In [181]:
trainData_url = 'https://raw.githubusercontent.com/Datamanim/datarepo/main/cancer/train.csv'
testData_url = 'https://raw.githubusercontent.com/Datamanim/datarepo/main/cancer/test.csv'
subData_url = 'https://raw.githubusercontent.com/Datamanim/datarepo/main/cancer/submission.csv'

데이터 설명 :  유방암 발생여부 예측 (종속변수 diagnosis : B(양성)  , M(악성) )
문제타입 : 분류유형
평가지표 : f1-scor

In [182]:
trainData = pd.read_csv(trainData_url)
testData = pd.read_csv(testData_url)
subData = pd.read_csv(subData_url)

In [183]:
trainData.head(2)

        id diagnosis  ...  symmetry_worst  dimension_worst
0  8812844         B  ...          0.3055          0.08797
1   904689         B  ...          0.3207          0.07247

[2 rows x 32 columns]

In [184]:
testData.head(2)

       id  radius_mean  ...  symmetry_worst  dimension_worst
0  915186        9.268  ...          0.3038          0.12520
1  869224       12.900  ...          0.3549          0.08118

[2 rows x 31 columns]

In [185]:
subData.head(2)

     0
0  0.0
1  0.0

In [186]:
trainData.shape

(454, 32)

In [187]:
X = trainData[trainData.columns[2:32]]

In [188]:
y_before = trainData[["diagnosis"]]

In [189]:
y = y_before.replace(['B','M'],[0,1])

In [190]:
y.head(2)

   diagnosis
0          0
1          0

In [191]:
print(X.shape)
print(y.shape)

(454, 30)
(454, 1)

In [192]:
from sklearn.model_selection import train_test_split

In [193]:
X_train, X_test, y_train, y_test = train_test_split(X,y, random_state=42)

In [194]:
from sklearn.preprocessing import MinMaxScaler
mms = MinMaxScaler()
mms.fit(X_train)
X_train_scaled = mms.transform(X_train)
X_test_sacled = mms.transform(X_test)

In [195]:
from sklearn.ensemble import RandomForestClassifier

In [196]:
model = RandomForestClassifier(random_state=42)

In [197]:
model.fit(X_train_scaled, y_train)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  """Entry point for launching an IPython kernel.

RandomForestClassifier(random_state=42)

In [198]:
pred_train = model.predict(X_train_scaled)
pred_test = model.predict(X_test_sacled)

In [199]:
from sklearn.metrics import f1_score

In [200]:
f1_train = f1_score(y_train, pred_train)
f1_test = f1_score(y_test, pred_test)

In [201]:
print(f1_train)
print(f1_test)

1.0
0.9494949494949494

In [202]:
testData.shape

(115, 31)

In [203]:
sub_raw = testData[testData.columns[1:31]]

In [205]:
sub_ready = mms.transform(sub_raw)

In [206]:
sub_data = model.predict(sub_ready)

In [207]:
sub_data[0:20]

array([0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 1, 0, 1, 1, 1, 1, 0, 0, 0, 1])

In [208]:
subData['0'] = sub_data

In [209]:
subData.head(2)

   0
0  0
1  0

In [210]:
subData.to_csv('submisson.csv', index=False)